In [1]:
import numpy as np
import pandas as pd
from sklearn import preprocessing

In [2]:
my_data = pd.read_csv(r'E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\mydata.csv')

In [3]:
my_data

   columns1 columns2 columns3
0         1        a        A
1         2        a        A
2         2        a        A
3         3        b        B
4         4        b        B
5         4        b        B

In [4]:
my_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [5]:
my_data.drop_duplicates()

   columns1 columns2 columns3
0         1        a        A
1         2        a        A
3         3        b        B
4         4        b        B

In [6]:
my_data.drop_duplicates(['columns2'])

   columns1 columns2 columns3
0         1        a        A
3         3        b        B

In [7]:
my_source1 = pd.read_csv('E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\my_source1.csv')
my_source1

       0  1   2   3   4
0  babak  1  13  17  17
1   raha  2  14  14  15
2   sara  3  17  12  20
3   reza  4  12  18  19

In [8]:
my_source2 = pd.read_csv('E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\my_source2.csv')
my_source2

        0  1   2   3
0   babak  1  13  17
1   baran  2  15  20
2    sara  3  14  19
3   arash  4  20  19
4  mehran  5  15  18
5    reza  6  14  12

In [9]:
my_concat = pd.concat([my_source1 , my_source2] , axis = 0 , ignore_index = True)
my_concat

        0  1   2   3     4
0   babak  1  13  17  17.0
1    raha  2  14  14  15.0
2    sara  3  17  12  20.0
3    reza  4  12  18  19.0
4   babak  1  13  17   NaN
5   baran  2  15  20   NaN
6    sara  3  14  19   NaN
7   arash  4  20  19   NaN
8  mehran  5  15  18   NaN
9    reza  6  14  12   NaN

In [10]:
my_concat.drop(['4'] , axis = 1 , inplace = True)
my_concat

        0  1   2   3
0   babak  1  13  17
1    raha  2  14  14
2    sara  3  17  12
3    reza  4  12  18
4   babak  1  13  17
5   baran  2  15  20
6    sara  3  14  19
7   arash  4  20  19
8  mehran  5  15  18
9    reza  6  14  12

In [11]:
my_concat.drop_duplicates(inplace = True)
my_concat

        0  1   2   3
0   babak  1  13  17
1    raha  2  14  14
2    sara  3  17  12
3    reza  4  12  18
5   baran  2  15  20
6    sara  3  14  19
7   arash  4  20  19
8  mehran  5  15  18
9    reza  6  14  12

In [12]:
smartphone = pd.read_csv('E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\smartphone.csv')
smartphone

                Name        OS  Capacity  Ram  Weight    Company  inch
0         Galaxy S10   Android       128    8   163.0    Samsung   6.2
1          Lumia 950  windows         32    3   150.0  Microsoft   5.2
2        Xpreia 1 ll   Android       256    8   181.0       Sony   6.5
3           iphone13       ios       128    2   138.0      Apple   4.7
4            U Ultra   Android        64    4   170.0        HTC   5.7
5          Galaxy S8   Android        16    2   145.0    Samsung   5.1
6  iphone 11 pro max       ios       256    4   226.0      Apple   6.5
7            Moto G5   Android        16    3   144.5   Motorola   5.0
8             Pixel    Android       128    4   143.0     Google   5.0

In [13]:
smartphone.describe()

         Capacity       Ram      Weight      inch
count    9.000000  9.000000    9.000000  9.000000
mean   113.777778  4.222222  162.277778  5.544444
std     93.104481  2.279132   27.833333  0.698411
min     16.000000  2.000000  138.000000  4.700000
25%     32.000000  3.000000  144.500000  5.000000
50%    128.000000  4.000000  150.000000  5.200000
75%    128.000000  4.000000  170.000000  6.200000
max    256.000000  8.000000  226.000000  6.500000

In [14]:
smartphone.OS.value_counts()

OS
Android     6
ios         2
windows     1
Name: count, dtype: int64

In [15]:
smartphone.Company.value_counts()

Company
Samsung      2
Apple        2
Microsoft    1
Sony         1
HTC          1
Motorola     1
Google       1
Name: count, dtype: int64

In [16]:
smartphone.drop('OS',axis = 1 , inplace = True)
smartphone.drop('Name',axis = 1, inplace = True)

smartphone.groupby(smartphone['Company']).mean()

           Capacity  Ram  Weight  inch
Company
Apple         192.0  3.0   182.0  5.60
Google        128.0  4.0   143.0  5.00
HTC            64.0  4.0   170.0  5.70
Microsoft      32.0  3.0   150.0  5.20
Motorola       16.0  3.0   144.5  5.00
Samsung        72.0  5.0   154.0  5.65
Sony          256.0  8.0   181.0  6.50

In [17]:
pd.crosstab(smartphone.OS,smartphone.Capacity)

AttributeError: 'DataFrame' object has no attribute 'OS'

In [ ]:
pd.pivot_table(smartphone,index = 'Name' , columns = 'Company' , values = 'Ram')

In [ ]:
smartphones = pd.read_csv('E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\smartphone.csv')
smartphones

In [ ]:
smartphones.rename(index = smartphones.Name , inplace = True)
smartphones

In [ ]:
smartphones.drop(['Name' , 'Company'] , axis = 1 , inplace = True)
smartphones

In [ ]:
smartphones_data = pd.get_dummies(smartphones)
smartphones_data